{
  "0,0": {
    "text": "\n     You are standing in the same field in which you first awoke\nwithout any memory of how you got here.  Which way?\n",
    "action": null
  },

  "-1,0": {
    "text": "\nAs you proceed west, you come upon signs of a battle, \nincluding two bodies lying face-down at the edge of a wood\n near the field in which you awoke.  There are no signs of\nlife.  Do you approach the bodies? (y/n)", 
    "action": "self.encounter"
  },

  "0,1": {
    "text": "\n     You walk for some time to finally arrive at an old, \napparently abandoned fortress which has decayed with time.  \nThere is nothing here but ruin.  As you approach an outcrop \nof rock, you realize there is a narrow passage leading down \ninto the ground, perhaps an old cellar entrance.  \nDo you enter? (y/n)",
    "action": "self.encounter"
  },

  "0,2": {
    "text": "\n     As you head north around the abandoned and crumbling\nfortress you see a valley spread out before you.  In the\ndistance to the north is a village with wafts of smoke being\ncarried off by the breeze trailing over the scene like\nthe twisted tails of many kites.  To the west gently\nsloping foothills transition into distant blue mountains\nand to the east, a vast forest conspires to block out all \nsurface detail.",
    "action": null
  }
}

// TODO: convert below into above format
outcomes = { (-1,0,1): 
{'y': ["\nAs you approach one of the bodies closely, you realize\n that he is feigning death when he rolls quickly and \nsinks a blade into your neck.  Your life fades quickly.", self.die],
 'n': ["\nWell, daylight's a-wasting.  Where to now?"]}, 
(0,1,1):
 {'y': ["\nYou steal yourself and proceed down the cracked and \ndisintegrating steps only to find a locked wooden door.  \n\nDo you attempt to force the lock? (y/n)", self.next_choice],
  'n': ["\nWhere to now?"]},
(0,1,2): 
 {'y': ["\nYou put all your force into it as you drive your shoulder \ninto the door.  The door gives way in a sudden explosion \nof dust and splinters.  \n\nIt's too dark to proceed safely without a lantern and so \nyou return through the broken doorway and back up the stairs \nto the crumbling remains of the fortress above."], 
       'n': ["\nWhere to now?"]},
(999,999,999):   {"Command not recognized.  Please type 'h' for help."}
}